Tests/otherTests/Files/xml.xml

<?xml version="1.0" encoding="utf-8"?>
<Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns="http://schemas.xmlsoap.org/soap/envelope/">
        <Body>
                <SendRequestRequest xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1">
                        <SenderProvidedRequestData Id="SIGNED_BY_CALLER">
                                <MessageID>2da2bcaa-e1b2-11ec-8fea-0242ac120002</MessageID>
                                <MessagePrimaryContent xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">
                                        <ns1:FNSVipIPRequest НомерДела="БН"
                                                             ИдДок="22FE13EF-FDE8-05F2-E050-A8C0D3C820B5"
                                                             xmlns:ns1="urn://x-artefacts-fns-vipip-tosmv-ru/311-15/4.0.5">
                                                <ns1:ЗапросИП>
                                                        <ns1:ИНН>772770224286</ns1:ИНН>
                                                </ns1:ЗапросИП>
                                        </ns1:FNSVipIPRequest>
                                </MessagePrimaryContent>
                        </SenderProvidedRequestData>
                </SendRequestRequest>
        </Body>
</Envelope>